app/views/users/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      <% @books.each do |book| %>
        <% user = User.find(book.user_id) %>

SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", "1"]]
---
          <%= render 'shared/favorite', model: book %>
          <td>コメント件数：<%= book.book_comments.count %></td>