app/views/books/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    <% @book.book_comments.each do |book_comment| %>
      <% user = User.find(book_comment.user_id) %>