app/controllers/books_controller.rb

  def index
    @user = current_user
    @books = Book.all
---
SELECT "books".* FROM "books"

  def show
    @book = Book.find(params[:id])
    @user = User.find(@book.user_id)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @new_book = Book.new(book_params)
    @new_book.user_id = current_user.id
    @user = current_user

    if @new_book.save
      redirect_to book_path(@new_book), notice: "Book was successfully created."
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "aaaaaa"], ["body", "aaaaa"], ["created_at", "2021-03-15 06:51:25.650233"], ["updated_at", "2021-03-15 06:51:25.650233"], ["user_id", "1"]]
SELECT "books".* FROM "books"

  def edit
    @book = Book.find(params[:id])
    user = User.find(@book.user_id)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]