app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", "1"]]
---
  def show
    @user = User.find(params[:id])
    @books = Book.where(user_id: @user)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "d4fda4dc0e10e45cb93a28ea32a57e7f5b117d9321756c7b5ad5a40a4e28"], ["introduction", "aaaaaa"], ["updated_at", "2021-03-15 02:27:12.984347"], ["id", 2]]
---
  def update
    @user = User.find(params[:id])

    if @user.update(user_params)